# NeedsUnits Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldBuilder..::..NeedsUnits Method
FieldBuilder Class See Also
---
Checks whether the field type requires explicit unit conversions.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool NeedsUnits()
```

Visual Basic
---
```text
Public Function NeedsUnits As Boolean
```

Visual C++
---
```text
public:
bool NeedsUnits()
```

# ### Return Value
True if units are required.
# See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace